# Создайте функцию, принимающую на вход 3 числа, и возвращающую наибольшее из них


def nor(nomber1, nomber2, nomber3):
    print(max(nomber1, nomber2, nomber3))


nomber1 = input('Введите первое число:')
nomber2 = input('Введите второе число:')
nomber3 = input('Введите третье число:')

nor(nomber1, nomber2, nomber3)
