# Задача-1: поработайте с переменными, создайте несколько,
# выведите на экран, запросите от пользователя и сохраните в переменную, выведите на экран


hello = "Привет"
name = " "

print(hello)

name = input('Введите Ваше имя: ')
print(name)
