# Напишите скрипт, отображающий папки текущей директории.

import os

print(os.listdir())